# YOLOv5x with p2 for detect small object (self experimental)
# parameters
nc: 14  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple

# anchors
anchors: 3

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2                           # 0          
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4                        # 1
   [-1, 3, C3, [128]],                                          # 2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8                        # 3
   [-1, 9, C3, [256]],                                          # 4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16                       # 5
   [-1, 9, C3, [512]],                                          # 6
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32                      # 7
   [-1, 1, SPP, [1024, [5, 9, 13]]],                            # 8  
   [-1, 3, C3, [1024, False]],                                  # 9         
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [ 1024, 1, 1]],                                # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],                  # 11
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4                # 12  
   [-1, 3, C3, [ 512, False]],                                  # 13      

   [-1, 1, Conv, [ 256, 1, 1]],                                 # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],                  # 15
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3                # 16
   [-1, 3, C3, [ 256, False]],  # 17 (P3/8-small)               # 17

   [ -1, 1, Conv, [ 128, 1, 1 ] ],                              # 18
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ],              # 19
   [ [ -1, 2 ], 1, Concat, [ 1 ] ],  # cat backbone P2          # 20
   [ -1, 1, C3, [ 128, False ] ],  # 21 (P2/4-xsmall)           # 21

   [ -1, 1, Conv, [ 128, 3, 2 ] ],                              # 22
   [ [ -1, 18 ], 1, Concat, [ 1 ] ],  # cat head P3             # 23
   [ -1, 3, C3, [ 256, False ] ],  # 24 (P3/8-small)            # 24

   [-1, 1, Conv, [256, 3, 2]],                                  # 25
   [[-1, 14], 1, Concat, [1]],  # cat head P4                   # 26
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)              # 27

   [-1, 1, Conv, [512, 3, 2]],                                  # 28
   [[-1, 10], 1, Concat, [1]],  # cat head P5                   # 29
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)              # 30

   [[21, 24, 27, 30], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
